turbineSiting/gouda/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (6.9 0 0);
boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletVelocity;
        Uref            6.9;
        Zref            84.63999938964844;
        zDir            (0 0 1);
        flowDir         (1 0 0);
        z0              uniform 0.1;
        zGround         uniform 64.63999938964844;
        value           $internalField;
    }
    outlet
    { type            inletOutlet; inletValue      uniform (0 0 0); value           $internalField; }
    terrain { type            noSlip; }
    ground { type            noSlip; }
    sky { type            slip; }
    frontAndBack { type            symmetry; }
}