turbineSiting/gouda/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.018564;
boundaryField
{
    inlet
    {
        type            atmBoundaryLayerInletEpsilon;
        Uref            6.9;
        Zref            84.63999938964844;
        zDir            (0 0 1);
        flowDir         (1 0 0);
        z0              uniform 0.1;
        zGround         uniform 64.63999938964844;
        value           $internalField;
    }
    outlet
    { type            inletOutlet; inletValue      $internalField; value           $internalField; }
    terrain { type            epsilonWallFunction; value           uniform 0; }
    ground { type            zeroGradient; }
    sky { type            slip; }
    frontAndBack { type            symmetry; }
}