turbineSiting/gouda/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;
vertices
(
    (-4909.61 -5102.06 14.64)
    (10467.69 -5102.06 14.64)
    (10467.69 5417.03 14.64)
    (-4909.61 5417.03 14.64)
    (-4909.61 -5102.06 864.64)
    (10467.69 -5102.06 864.64)
    (10467.69 5417.03 864.64)
    (-4909.61 5417.03 864.64)
);

//blocks ( hex (0 1 2 3 4 5 6 7) (192 131 35) simpleGrading (1 1 1) );
blocks ( hex (0 1 2 3 4 5 6 7) (80 80 35) simpleGrading (1 1 1) );


boundary (
    inlet { type patch; faces ((0 3 7 4)); }
    outlet { type patch; faces ((1 5 6 2)); }
    ground { type wall; faces ((0 1 2 3)); }
    sky { type patch; faces ((4 5 6 7)); }
    frontAndBack { type symmetry; faces ( (0 4 5 1) (3 2 6 7) ); } 
);