turbineSiting/gouda/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
solver incompressibleFluid;
startFrom latestTime;
stopAt endTime;
endTime 1000;
deltaT 1;
writeInterval 100;
purgeWrite 2;
writeFormat ascii;
libs ("libatmosphericModels.so" "libfvModels.so");